{
  "Prestidigitation": {
    "level": "Cantrip",
    "school": "Transmutation",
    "time": "1 action",
    "range": "10ft",
    "components": "V, S",
    "duration": "1hr",
    "description": "Create small magical effects."
  },
  "Fire Bolt": {
    "level": "Cantrip",
    "school": "Evocation",
    "time": "1 action",
    "range": "120ft",
    "components": "V, S",
    "duration": "Instantaneous",
    "description": "Make a ranged spell attack. On a hit, the target takes 1d10 fire damage. Flammable objects not worn/carried are lit. The damage increases by 1d10 at each of level 5, 11, and 17."
  },
  "Ray of Frost": {
    "level": "Cantrip",
    "school": "Evocation",
    "time": "1 action",
    "range": "60ft",
    "components": "V, S",
    "duration": "Instantaneous",
    "description": "Make a ranged spell attack. On a hit, the target takes 1d8 cold damage and has its speed reduced by 10 until the start of your next turn. The damage increases by 1d8 at each of level 5, 11, and 17."
  },
  "Minor Illusion": {
    "level": "Cantrip",
    "school": "Illusion",
    "time": "1 action",
    "range": "30ft",
    "components": "S, M",
    "duration": "1min",
    "description": "Create a small sound or image. Is dispelled if the spell is cast again or manually dismissed as an action. Sounds can range in loudness from a whisper to scream. Images must be smaller than 5ft cubes and has no mass. Disbelieving the illusion can be done through a successful Investigation check against the caster's spell save DC, upon which the illusion becomes faint to that creature. Physical interaction with an image immediately causes disbelief."
  },
  "Burning Hands": {
    "level": "1",
    "school": "Evocation",
    "time": "1 action",
    "range": "Self (15ft cone)",
    "components": "V, S",
    "duration": "Instantaneous",
    "description": "Each creature in the area takes 3D6 damage on failed Dexterity save or 1/2 on success. Any flammable objects in the area that aren't carried or worn are lit. The damage increases by 1D6 for each spell slot above 1."
  },
  "Color Spray": {
    "level": "1",
    "school": "Illusion",
    "time": "1 action",
    "range": "Self (15 cone)",
    "components": "V, S, M",
    "duration": "1 round",
    "description": "Roll 6d10: that amount of HP of creatures in the area are affected in ascending order of current HP. Affected creatures are blinded for the duration. If the remaining HP is not enough to equal a next creature's current HP, that creature and others are not effected."
  },
  "Detect Magic": {
    "level": "1",
    "school": "Divination",
    "time": "1 action or ritual",
    "range": "Self",
    "components": "V, S",
    "duration": "Concentration to 10min",
    "description": "For the duration, you can sense magic within 30ft. You can use an action to see a faint aura around a visible target in the area that bears magic and know the school. The vision is blocked by 1ft of stone, 1in of metal, a sheet of lead, or 3ft of wood/dirt but otherwise penetrates."
  },
  "Find Familiar": {
    "level": "1",
    "school": "Conjuration",
    "time": "1hr ritual",
    "range": "10ft",
    "components": "V, S, M (10 gold of supplies)",
    "duration": "Instantaneous",
    "description": "Gain a familiar in the form of bat/cat/crab/frog/tad/hawk/lizard/octopus/owl/snake/fish/rat/raven/sea horse/spider/weasel. The animal is your choice of celestial/fey/fiend. The familiar acts on its own but obeys commands including in combat (though it cannot attack). When within 100ft, you and it can communicate telepathically. Spending an action allows you to use the familiar's eyes/ears for a round, during which you are deaf and blind in your own body. Can spend an action to temporarily or permanently dismiss. Can't have more than 1 familiar at a time. Can cast a spell with range 'touch' through the familiar when it's within 100ft and uses its reaction."
  },
  "Fog Cloud": {
    "level": "1",
    "school": "Conjuration",
    "time": "1 action",
    "range": "120ft",
    "components": "V, S",
    "duration": "Concentration to 1hr",
    "description": "Create a 20ft radius sphere of fog at a point, which spreads around corners, making the entire heavily obscured. Can be removed by a wind of 10+ mph. The radius increases by 20ft for each spell slot above 1."
  },
  "Shield": {
    "level": "1",
    "school": "Abjuration",
    "time": "1 reaction when being attacked",
    "range": "Self",
    "components": "V, S",
    "duration": "1 round",
    "description": "Until the start of your next turn, you have +5 AC including against the currently incoming attack and take no damage from 'Magic Missile'."
  },
  "Grease": {
    "level": "1",
    "school": "Conjuration",
    "time": "1 action",
    "range": "60ft",
    "components": "V, S, M",
    "duration": "1min",
    "description": "Cover a 10ft square in grease, turning it into difficult terrain. Any creature that is in the area when cast, moves into the area, or ends its turn in the area must make a Dexterity save or fall prone."
  },
  "Witch Bolt": {
    "level": "1",
    "school": "Evocation",
    "time": "1 action",
    "range": "30ft",
    "components": "V, S, M",
    "duration": "Concentration to 1min",
    "description": "Ranged spell attack. If successful, lightning connects you to the target, dealing 1d12 lightning damage on creation and 1d12 lightning damage on every subsequent turn where you use your action to trigger the effect again, though the spell ends if not sustained in this manner. The damage increases by 1d12 for each spell slot above 1."
  },
  "Invisibility": {
    "level": "2",
    "school": "Illusion",
    "time": "1 action",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "Concentration to 1hr",
    "description": "The target and anything they're carrying/wearing is made invisible. Ends if they attack or cast. Number of affected targets increases by 1 for each spell slot above 2."
  },
  "Web": {
    "level": "2",
    "school": "Conjuration",
    "time": "1 action",
    "range": "60ft",
    "components": "V, S, M",
    "duration": "Concentration to 1hr",
    "description": "Fill a 20ft cube with webs, making the area difficult terrain and lightly obscured. The webs must be connected to something on at least 2 sides, though they can be layed on the floor/wall/ceiling. Any creature that moves into or starts its turn in the webs must make a Dexterity save or be restrained, which requires a Strength check against the spell DC to break free. The web is flammable, being destroyed 5ft/round when exposed to fire, dealing 2d4 fire damage to any creature that starts its turn in the fire."
  },
  "Scorching Ray": {
    "level": "2",
    "school": "Evocation",
    "time": "1 action",
    "range": "120ft",
    "components": "V, S",
    "duration": "Instantaneous",
    "description": "Create 3 rays of fire and send them at targets, choosing between 1 and the number of rays for the number of targets. Each ray requires a ranged spell attack, dealing 2d6 fire damage on a hit. Create an additonal ray for each spell slot above 2."
  },
  "Enlarge/Reduce": {
    "level": "2",
    "school": "Transmutation",
    "time": "1 action",
    "range": "30ft",
    "components": "V, S, M",
    "duration": "Concentration to 1min",
    "description": "The target is enlarged or reduce unless they succeed at a Constitution save. A creature is transformed along with everything they're carrying/wearing, though those items return to normal size immediately after being dropped. ENLARGED targets have size multiplied by 2, weight multiplied by 1, and size category increased by 1. Any environmental limitation to reaching this full size caps the target at the largest available for the space its in. An enlarged creature has advantage on Strength checks and saves and their weapons deal +1d4 extra damage. REDUCED targets have their size divided by 2, weight divided by 8, and size category reduced by 1. A reduced creature has disadvantage on Strength checks and saves and their weapons deal -1d4 damage (but cannot be less than 1)."
  },
  "Create Bonfire": {
    "level": "Cantrip",
    "school": "Conjuration",
    "time": "1 action",
    "range": "60ft",
    "components": "V, S",
    "duration": "Concentration to 1min",
    "description": "Create a 5ft-cube bonfire on the ground. Any creature in that space upon casting must make a Dexterity save or take 1d8 fire damage; this also applies to creatures moving into the space or ending their turn in that space. Ignites flammable objects that aren't carried/worn. The damage increases by 1d8 at each of levels 5, 11, and 17."
  },
  "Mending": {
    "level": "Cantrip",
    "school": "Transmutation",
    "time": "1min",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "Instantaneous",
    "description": "Repairs a single break/tear in an object of up to 1ft in all dimensions."
  },
  "Mold Earth": {
    "level": "Cantrip",
    "school": "Transmutation",
    "time": "1 action",
    "range": "30ft",
    "components": "S",
    "duration": "Instantaneous",
    "description": "Choose a 5ft cube of earth. You can excavate loose earth and move it up to 5ft away. You can change the shape and/or color of the earth, which lasts for 1hr. You can change it to or from difficult terrain, which lasts for 1hr. Can only have 2 non-instantaneous effects active. Any change can be dismissed with an action."
  },
  "Catapult": {
    "level": "1",
    "school": "Transmutation",
    "time": "1 action",
    "range": "60ft",
    "components": "S",
    "duration": "Instantaneous",
    "description": "Choose an object of under 5lbs that isn't worn/carried. That object flies in a straight line up to 90ft away in a selected direction. If it strikes a creature, the creature must make a Dexterity save or take 3d8 bludgeoning damage, and the flying object stops. The damage increases by 1d8 and max weight by 5lbs for each spell slot above 1."
  },
  "Ice Knife": {
    "level": "1",
    "school": "Conjuration",
    "time": "1 action",
    "range": "60ft",
    "components": "S, M",
    "duration": "Instantaneous",
    "description": "Fling a shard of ice by making a ranged spell attack against a target. On hit, the target takes 1d10 piercing damage. When the shard reaches its target, it explodes, causing every creature within 5ft to make a Dexterity save or take 2d6 cold damage. The cold damage increases by 1d6 for each spell slot above 1."
  },
  "Unseen Servant": {
    "level": "1",
    "school": "Conjuration",
    "time": "1 action or ritual",
    "range": "60ft",
    "components": "V, S, M",
    "duration": "1hr",
    "description": "Create a invisible/mindless/shapeless force that follows commands. AC = 10, HP = 1, Strength = 2. It cannot attack. As a bonus action, you can mentally command it to move up to 15ft and interact with an object. If it moves more than 60ft away from you, the spell ends."
  },
  "Feather Fall": {
    "level": "1",
    "school": "Transmutation",
    "time": "1 reaction",
    "range": "60ft",
    "components": "V, M",
    "duration": "1min",
    "description": "Choose up to 5 falling creatures. Their fall speed becomes at max 60ft/round. If the creature lands before the spell expires, they take no damage and the effect on them ends."
  },
  "Longstrider": {
    "level": "1",
    "school": "Transmutation",
    "time": "1 action",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "1hr",
    "description": "The creature's speed increases by 10ft."
  },
  "Pyrotechnics": {
    "level": "2",
    "school": "Transmutation",
    "time": "1 action",
    "range": "60ft",
    "components": "V, S",
    "duration": "Instantaneous",
    "description": "Choose a 5ft cube of nonmagical flame. You can extinguish it, creating either fireworks or smoke. FIREWORKS causes the fire to explore with many colors, causing creatures within 10ft of the fire to make a Constitution save or be blinded until the end of your next turn. SMOKE causes a 20ft radius of heavily obscured air, which lasts for 1min unless a strong wind clears it."
  },
  "Dust Devil": {
    "level": "2",
    "school": "Conjuration",
    "time": "1 action",
    "range": "60ft",
    "components": "V, S, M",
    "duration": "1min",
    "description": "Create a dust devil in a 5ft unoccupied cube. Any creature that ends its turn with 5ft of the dust devil must make a Strength save or take 1d8 bludgeoning damage and be pushed 10ft away (1/2 damage and no push on successful save). As a bonus action, you can move the dust devil up to 30ft in any direction. If it moves over sand/dust/dirt/gravel, it sucks it up and makes a 10ft radius heavily obscured cloud around itself lasting until the end of your next turn."
  },
  "Earthen Grasp": {
    "level": "2",
    "school": "Transmutation",
    "time": "1 action",
    "range": "30ft",
    "components": "V, S, M",
    "duration": "1min",
    "description": "Choose a 5ft square of unoccupied space on the ground. A medium-sized hand from the soil is created and reaches for 1 creature you can see within 5ft, causing that creature to make a Strength save or take 2d6 bludgeoning damage and be restrained. As an action, you can cause the hand to crush a restrained target, causing 2d6 bludgeoning damage on a failed Strength save or 1/2 on a success. As an action, you can cause the hand to reach for a different target or move to another unoccupied space within the spell's range; either of these effects sets any restrained target loose. A restrained target must succeed at a Strength save to escape."
  },
  "Floating Disk": {
    "level": "1",
    "school": "Conjuration",
    "time": "1 action or ritual",
    "range": "30ft",
    "components": "V, S, M",
    "duration": "1hr",
    "description": "Create a plane of force 3ft across and 1in think that floats 3ft above the ground. It can hold up to 500lbs. If you move 20ft away from the disk, it approaches you until it's within 20ft. It cannot cross an elevation change of 10ft or more. If it is ever more than 100ft away from you, the spell ends."
  }
}
